Revit 2024 API
FamilyLoadedIntoDocumentEventArgs.FamilyName Property
 The file name of the family that is loaded into the document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string FamilyName { get; }
Visual Basic
Public ReadOnly Property FamilyName As String
	Get
Visual C++
public:
property String^ FamilyName {
	String^ get ();
}
See Also
FamilyLoadedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace